{
  "year": 2025,
  "days": [
    {
      "dayNumber": 1,
      "unlockDate": "2025-12-01",
      "title": "The Beginning",
      "subtitle": "Abraham: Father of Faith",
      "devotionalText": "In the genealogy of Jesus Christ, we begin with Abraham, the father of faith. God called Abraham to leave everything he knew and journey to an unknown land. Through Abraham's obedience, God established a covenant that would bless all nations. This Christmas season, we remember that Jesus came as the ultimate fulfillment of God's promise to Abraham.\n\nConsider how Abraham's faith journey mirrors our own walk with God. He didn't know where he was going, but he trusted the One who called him. As we prepare our hearts for Christmas, let us renew our trust in God's promises.",
      "scriptureReference": "Matthew 1:1-2",
      "reflection": "What promises of God are you trusting Him for this season? How can you demonstrate faith like Abraham in your daily life?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 1: Abraham's Journey of Faith",
      "videoDuration": "5:23"
    },
    {
      "dayNumber": 2,
      "unlockDate": "2025-12-02",
      "title": "Faith",
      "subtitle": "Isaac: The Child of Promise",
      "devotionalText": "Isaac was the miracle child, born to Abraham and Sarah in their old age. His very existence was a testament to God's faithfulness and power. Isaac's birth demonstrated that nothing is impossible with God.\n\nAs we reflect on Isaac's story, we're reminded that God's timing is perfect. Sarah and Abraham waited decades for this promise to be fulfilled. In our own lives, we often struggle with waiting, but God is always faithful to His word.",
      "scriptureReference": "Matthew 1:2",
      "reflection": "Where are you waiting for God's promises to be fulfilled? How can you trust in His perfect timing?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 2: The Promise of Isaac",
      "videoDuration": "4:58"
    },
    {
      "dayNumber": 3,
      "unlockDate": "2025-12-03",
      "title": "Hope",
      "subtitle": "Jacob: Wrestling with God",
      "devotionalText": "Jacob's life was marked by struggle and transformation. From deceiving his father to wrestling with God, Jacob's journey shows us that God can work through our imperfections. His encounter with God at Peniel changed him forever, and he became Israel, the father of the twelve tribes.\n\nThis Advent, we're reminded that our struggles don't disqualify us from God's purposes. Instead, they're often the very places where God meets us and transforms us.",
      "scriptureReference": "Matthew 1:2",
      "reflection": "What areas of your life need God's transforming touch? Are you willing to wrestle with God in prayer?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 3: Jacob's Transformation",
      "videoDuration": "5:12"
    },
    {
      "dayNumber": 4,
      "unlockDate": "2025-12-04",
      "title": "Promise",
      "subtitle": "Judah: From Whom Kings Come",
      "devotionalText": "Judah, one of Jacob's twelve sons, became the royal line through which Jesus would come. Despite his past mistakes and moral failures, God chose Judah's lineage for the Messiah. This reminds us that God's grace is greater than our failures.\n\nThe name Judah means 'praise,' and it's through his line that the ultimate reason for praise—Jesus Christ—would enter the world.",
      "scriptureReference": "Matthew 1:2-3",
      "reflection": "How has God shown grace in your life despite your failures? How can you offer praise to God today?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 4: The Royal Line of Judah",
      "videoDuration": "5:05"
    },
    {
      "dayNumber": 5,
      "unlockDate": "2025-12-05",
      "title": "Covenant",
      "subtitle": "Perez and Zerah: Twins of Destiny",
      "devotionalText": "The story of Perez and Zerah, born to Judah and Tamar, is unusual and complex. Yet God included this messy family situation in the lineage of Christ. This shows us that God's redemptive plan includes all kinds of people and situations.\n\nGod doesn't sanitize history or ignore difficult circumstances. Instead, He works through them to accomplish His purposes.",
      "scriptureReference": "Matthew 1:3",
      "reflection": "What difficult circumstances in your life might God be using for His purposes? How can you trust Him in complexity?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 5: Redemption in Complexity",
      "videoDuration": "4:45"
    },
    {
      "dayNumber": 6,
      "unlockDate": "2025-12-06",
      "title": "Journey",
      "subtitle": "Rahab: The Gentile Included",
      "devotionalText": "Rahab was a Canaanite woman, a prostitute who chose to believe in the God of Israel. Her faith saved her family during the conquest of Jericho, and she was grafted into the people of God. Remarkably, she became part of Jesus' ancestry.\n\nRahab's inclusion in Christ's genealogy demonstrates that salvation is for all people, regardless of their past or background. God's grace knows no boundaries.",
      "scriptureReference": "Matthew 1:5",
      "reflection": "How does Rahab's story encourage you about God's acceptance and grace? Who in your life needs to hear about God's inclusive love?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 6: Faith That Saves",
      "videoDuration": "5:20"
    },
    {
      "dayNumber": 7,
      "unlockDate": "2025-12-07",
      "title": "Blessing",
      "subtitle": "Ruth: Faithful Love",
      "devotionalText": "Ruth, a Moabite widow, chose to follow her mother-in-law Naomi back to Israel. Her famous words, 'Your people will be my people, and your God my God,' demonstrate her commitment and faith. Through her marriage to Boaz, she became the great-grandmother of King David.\n\nRuth's story is one of loyalty, redemption, and God's providence. It shows how God works through ordinary people who make faithful choices.",
      "scriptureReference": "Matthew 1:5",
      "reflection": "What does faithful love look like in your relationships? How can you demonstrate steadfast commitment like Ruth?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 7: Ruth's Faithful Devotion",
      "videoDuration": "5:15"
    },
    {
      "dayNumber": 8,
      "unlockDate": "2025-12-08",
      "title": "Wisdom",
      "subtitle": "David: A Man After God's Heart",
      "devotionalText": "King David, the shepherd boy who became Israel's greatest king, was described as 'a man after God's own heart.' Despite his significant failures, David's heart for worship and repentance set him apart. God promised that the Messiah would come from David's line.\n\nDavid's psalms reveal a heart that sought God in every circumstance. His legacy reminds us that what God values most is a heart that pursues Him.",
      "scriptureReference": "Matthew 1:6",
      "reflection": "What does it mean to be a person after God's own heart? How can you cultivate a worshipful heart like David's?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 8: David's Heart for God",
      "videoDuration": "5:30"
    },
    {
      "dayNumber": 9,
      "unlockDate": "2025-12-09",
      "title": "Strength",
      "subtitle": "Solomon: Wisdom and Glory",
      "devotionalText": "Solomon, David's son, was known for his wisdom and the glory of his reign. He built the magnificent temple in Jerusalem and wrote much of the wisdom literature in the Bible. Yet despite his gifts, Solomon's heart eventually turned away from God.\n\nSolomon's life teaches us that wisdom and success don't guarantee faithfulness. We must guard our hearts and remain devoted to God throughout our lives.",
      "scriptureReference": "Matthew 1:6-7",
      "reflection": "How can you pursue both wisdom and faithfulness? What areas of your heart need guarding?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 9: Solomon's Wisdom",
      "videoDuration": "4:50"
    },
    {
      "dayNumber": 10,
      "unlockDate": "2025-12-10",
      "title": "Mercy",
      "subtitle": "The Kings: Rising and Falling",
      "devotionalText": "After Solomon, the kingdom divided and a long line of kings followed—some good, many bad. This period shows the cycle of faithfulness and unfaithfulness in Israel's history. Yet through it all, God remained faithful to His promise that the Messiah would come.\n\nEven when His people failed repeatedly, God's plan continued. This demonstrates His unwavering commitment to redeem humanity.",
      "scriptureReference": "Matthew 1:7-11",
      "reflection": "How have you seen God remain faithful even when you've been unfaithful? What does this teach you about His character?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 10: God's Faithfulness Through Generations",
      "videoDuration": "5:10"
    },
    {
      "dayNumber": 11,
      "unlockDate": "2025-12-11",
      "title": "Grace",
      "subtitle": "The Exile: God's Discipline and Mercy",
      "devotionalText": "The Babylonian exile was a dark period in Israel's history. The people were carried away from the Promised Land due to their persistent rebellion. Yet even in exile, God did not abandon them. The genealogy continues through this difficult time, showing that God's purposes cannot be thwarted.\n\nThe exile reminds us that God disciplines those He loves, but His discipline is always for our restoration, not our destruction.",
      "scriptureReference": "Matthew 1:11-12",
      "reflection": "Have you experienced God's discipline? How have you seen His love and mercy in difficult seasons?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 11: Hope in Exile",
      "videoDuration": "5:00"
    },
    {
      "dayNumber": 12,
      "unlockDate": "2025-12-12",
      "title": "Light",
      "subtitle": "The Return: Coming Home",
      "devotionalText": "After seventy years, God brought His people back from exile to rebuild Jerusalem. This return symbolized hope, restoration, and God's unchanging promises. The genealogy continues through this period of rebuilding.\n\nThe return from exile foreshadows the ultimate return we experience through Christ—being brought back to God from our spiritual exile.",
      "scriptureReference": "Matthew 1:12-13",
      "reflection": "In what ways has God brought you back to Him? How can you help others find their way home to God?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 12: The Return to Jerusalem",
      "videoDuration": "4:55"
    },
    {
      "dayNumber": 13,
      "unlockDate": "2025-12-13",
      "title": "Truth",
      "subtitle": "The Silent Years: Waiting for Messiah",
      "devotionalText": "Between the end of the Old Testament and the birth of Jesus, there were four hundred years of silence—no prophets, no new revelation. Yet during this time, God was preparing the world for the coming of Christ. The genealogy quietly continued through these generations.\n\nSometimes God works most powerfully in the silence. When we don't hear from Him, He is still at work, preparing the way for His purposes.",
      "scriptureReference": "Matthew 1:13-15",
      "reflection": "How do you respond when God seems silent? Can you trust Him to be working even when you don't see or hear Him?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 13: Waiting in the Silence",
      "videoDuration": "5:18"
    },
    {
      "dayNumber": 14,
      "unlockDate": "2025-12-14",
      "title": "Peace",
      "subtitle": "Joseph: A Righteous Man",
      "devotionalText": "Joseph, a carpenter from Nazareth, was betrothed to Mary when he discovered she was pregnant. As a righteous man, he planned to divorce her quietly. But God spoke to him in a dream, revealing that Mary's child was conceived by the Holy Spirit.\n\nJoseph's willingness to obey God, despite the social cost, shows remarkable faith and character. He became the earthly father figure for the Son of God.",
      "scriptureReference": "Matthew 1:18-19",
      "reflection": "How do you respond when God's plans don't match your expectations? What does it mean to be righteous in difficult circumstances?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 14: Joseph's Faithful Obedience",
      "videoDuration": "5:25"
    },
    {
      "dayNumber": 15,
      "unlockDate": "2025-12-15",
      "title": "Joy",
      "subtitle": "The Angel's Message: Fear Not",
      "devotionalText": "The angel appeared to Joseph with an incredible message: 'Do not be afraid to take Mary as your wife. The child conceived in her is from the Holy Spirit.' This divine reassurance changed everything for Joseph.\n\nThroughout Scripture, when angels appear, they often begin with 'Fear not.' God's presence brings peace, not terror. His plans are good, even when they seem impossible.",
      "scriptureReference": "Matthew 1:20",
      "reflection": "What fears is God asking you to release? How can you trust His good plans for your life?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 15: Do Not Be Afraid",
      "videoDuration": "4:48"
    },
    {
      "dayNumber": 16,
      "unlockDate": "2025-12-16",
      "title": "Love",
      "subtitle": "Immanuel: God With Us",
      "devotionalText": "The angel told Joseph that Mary would bear a son, and they would name Him Jesus, for He would save His people from their sins. This fulfilled Isaiah's prophecy: 'The virgin will conceive and give birth to a son, and they will call him Immanuel' (which means 'God with us').\n\nThe incarnation is the ultimate expression of God's love—He didn't stay distant but came to dwell with us.",
      "scriptureReference": "Matthew 1:21-23",
      "reflection": "What does it mean to you that God chose to be with us? How does the reality of 'God with us' impact your daily life?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 16: God With Us",
      "videoDuration": "5:35"
    },
    {
      "dayNumber": 17,
      "unlockDate": "2025-12-17",
      "title": "Sacrifice",
      "subtitle": "Jesus: The Name Above All Names",
      "devotionalText": "The name Jesus means 'The Lord saves.' This wasn't just a name—it was a mission statement. From the moment of His birth, Jesus' purpose was clear: to save His people from their sins.\n\nEvery time we say the name of Jesus, we're declaring the gospel. He is the Savior, the one who rescues us from sin and death.",
      "scriptureReference": "Matthew 1:21",
      "reflection": "What does salvation mean to you personally? How has Jesus saved you?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 17: The Savior's Name",
      "videoDuration": "5:08"
    },
    {
      "dayNumber": 18,
      "unlockDate": "2025-12-18",
      "title": "Redemption",
      "subtitle": "Joseph's Obedience: Taking Mary as His Wife",
      "devotionalText": "When Joseph woke from his dream, he did exactly what the angel commanded. He took Mary as his wife, publicly identifying with her and the child she carried. This act of obedience cost Joseph his reputation but gained him a place in God's redemptive story.\n\nTrue obedience often requires sacrifice. Joseph's example challenges us to follow God's will regardless of the personal cost.",
      "scriptureReference": "Matthew 1:24",
      "reflection": "What is God asking you to obey in, even if it's costly? How can you demonstrate faith through your actions?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 18: Costly Obedience",
      "videoDuration": "4:52"
    },
    {
      "dayNumber": 19,
      "unlockDate": "2025-12-19",
      "title": "Worship",
      "subtitle": "The Birth Approaches: Mary's Faith",
      "devotionalText": "While the genealogy in Matthew focuses on the legal lineage through Joseph, we cannot forget Mary's incredible faith. A young virgin who said yes to God's impossible plan, bearing the weight of scandal and mystery with grace and trust.\n\nMary's song of praise (the Magnificat) reveals her heart: she understood that God was doing something world-changing through her.",
      "scriptureReference": "Luke 1:46-55",
      "reflection": "How does Mary's response to God inspire you? What would it mean for you to say 'yes' to God's plans?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 19: Mary's Magnific at",
      "videoDuration": "5:22"
    },
    {
      "dayNumber": 20,
      "unlockDate": "2025-12-20",
      "title": "Prophecy",
      "subtitle": "Fourteen Generations: God's Perfect Pattern",
      "devotionalText": "Matthew organizes the genealogy into three sets of fourteen generations: from Abraham to David, from David to the exile, and from the exile to Christ. The number fourteen symbolizes completion and perfection in Jewish thought.\n\nGod's timing is perfect. Through all the generations, through faithfulness and failure, God was working out His plan to bring the Messiah at just the right time.",
      "scriptureReference": "Matthew 1:17",
      "reflection": "How have you seen God's perfect timing in your life? Can you trust His timing even when you don't understand it?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 20: Perfect Timing",
      "videoDuration": "5:00"
    },
    {
      "dayNumber": 21,
      "unlockDate": "2025-12-21",
      "title": "Fulfillment",
      "subtitle": "The Genealogy's Purpose: Proving Jesus is Messiah",
      "devotionalText": "Matthew began his gospel with this genealogy to prove that Jesus is the promised Messiah. He shows Jesus is the Son of David (the royal line) and the Son of Abraham (the promised seed). Every name in this list points to Jesus.\n\nThe entire Old Testament was preparation for this moment. All of history was moving toward the birth of Christ.",
      "scriptureReference": "Matthew 1:1",
      "reflection": "How does understanding Jesus as the fulfillment of prophecy strengthen your faith? What Old Testament promises do you see fulfilled in Christ?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 21: The Promised Messiah",
      "videoDuration": "5:28"
    },
    {
      "dayNumber": 22,
      "unlockDate": "2025-12-22",
      "title": "Wonder",
      "subtitle": "The Scandalous Grace: Women in the Genealogy",
      "devotionalText": "Four women are mentioned in Matthew's genealogy: Tamar, Rahab, Ruth, and Bathsheba. Each has a story marked by scandal, foreignness, or unconventional circumstances. Their inclusion shows that God's grace extends to all.\n\nGod doesn't work through perfect people. He works through broken, messy, real people who trust Him. This genealogy is a testament to grace.",
      "scriptureReference": "Matthew 1:3, 5, 6",
      "reflection": "How does the inclusion of these women encourage you about your own place in God's story? Who does God use in His plans?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 22: The Grace in the Genealogy",
      "videoDuration": "5:15"
    },
    {
      "dayNumber": 23,
      "unlockDate": "2025-12-23",
      "title": "Preparation",
      "subtitle": "The Long Wait: Preparing for the King",
      "devotionalText": "For generations, God's people waited for the Messiah. Prophets spoke of His coming, but century after century passed. Some lost hope. Others kept watching and waiting.\n\nAs we approach Christmas, we remember that waiting is part of God's plan. He uses waiting to prepare our hearts to receive what He wants to give us.",
      "scriptureReference": "Luke 2:25-32",
      "reflection": "What have you been waiting for God to do? How is He preparing your heart during this season of waiting?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 23: The Patient Wait",
      "videoDuration": "4:58"
    },
    {
      "dayNumber": 24,
      "unlockDate": "2025-12-24",
      "title": "Anticipation",
      "subtitle": "Christmas Eve: The Story Comes to Life",
      "devotionalText": "Tonight, we stand on the threshold of Christmas, just as the world stood on the threshold of Christ's birth. All the names we've studied—Abraham, David, Ruth, Joseph, Mary—led to this moment. The genealogy of names becomes flesh and blood in a manger in Bethlehem.\n\nThe Word became flesh and made His dwelling among us. The baby in the manger is the fulfillment of every promise, the answer to every prayer, the hope of every generation. Tomorrow we celebrate: Immanuel has come. God is with us.",
      "scriptureReference": "John 1:14",
      "reflection": "As you prepare to celebrate Christmas, how has this journey through Jesus' ancestry deepened your understanding of God's faithfulness? What will you worship Him for tomorrow?",
      "videoId": "dQw4w9WgXcQ",
      "videoTitle": "Day 24: The Word Became Flesh",
      "videoDuration": "5:40"
    }
  ]
}
